tgt_clsname = ['NILM','AGC','AGC-FN','AGC-N','AGC-NOS','ASC-US','LSIL','ASC-H','HSIL']

single_desc_set = []
for clsname in tgt_clsname:
    tgt_txt = f'data_resource/lesion_desc/{clsname}.txt'
    with open(tgt_txt, 'r') as f:
        for desc in f.readlines():
            desc = desc.strip()
            single_desc_set.extend(desc.split(','))

print(list(set(single_desc_set)))

'''
['核增大大于3倍', 'GEC', 'HSIL', '胞浆有空泡', '阴性', '核染色质轻度深染', '核大小不一', '失去极向，排列紊乱', '单个细胞', '葡萄干核型', '核膜不规则', '不完全挖空化细胞', '羽毛状排列', '核异形', 'AGC-NOS', '核染色质呈粗颗粒状', '非典型角化细胞', '细胞团呈三维簇团结构', 'Inflammatory', 'ASC-US', '成团细胞', '栅栏状排列紊乱', 'LSIL', '乳头状排列紊乱', '核轻度深染', '挖空细胞', '核染色质加深', '菊形团排列', '腺腔样排列', 'AGC', '核增大', '核异形性增强', 'NILM', '核仁增大/多核仁', 'ASC-H', '阳性', '核浆比大', 'AGC-FN', '异形双核或多核', '核染色质呈细颗粒状', '核位上移', '细胞的大小形态不一，排列紊乱', '核深染拥挤', 'AGC-N', '核增大到2.5-3倍']

'GEC', 'HSIL', '阴性', 'AGC-NOS', 'Inflammatory', 'ASC-US', 'LSIL', 'AGC', 'NILM', 'ASC-H', '阳性', 'AGC-FN', 'AGC-N', 

共 32 条短语描述
['核增大大于3倍', '胞浆有空泡', '核染色质轻度深染', '核大小不一', '失去极向，排列紊乱', '单个细胞', '葡萄干核型', '核膜不规则', '不完全挖空化细胞', '羽毛状排列', '核异形', '核染色质呈粗颗粒状', '非典型角化细胞', '细胞团呈三维簇团结构', '成团细胞', '栅栏状排列紊乱', '乳头状排列紊乱', '核轻度深染', '挖空细胞', '核染色质加深', '菊形团排列', '腺腔样排列', '核增大', '核异形性增强', '核仁增大/多核仁', '核浆比大', '异形双核或多核', '核染色质呈细颗粒状', '核位上移', '细胞的大小形态不一，排列紊乱', '核深染拥挤', '核增大到2.5-3倍']

'核深染拥挤' 应该拆分为：'核深染' and '核排列拥挤'



是否为成团细胞：'单个细胞', '成团细胞'

细胞核大小：'核增大', '核增大到2.5-3倍', '核增大大于3倍'
细胞核形状：'葡萄干核型', '核膜不规则', '核异形', '核异形性增强', 
细胞核位置：'核位上移', 
细胞核颜色：'核染色质轻度深染', '核染色质呈粗颗粒状', '核轻度深染', '核染色质加深', '核染色质呈细颗粒状', '核深染'
细胞核组合：'核大小不一', '核仁增大/多核仁', '异形双核或多核', '核排列拥挤'

细胞浆：'胞浆有空泡'

核浆关系：'核浆比大'

细胞排列：'失去极向，排列紊乱', '羽毛状排列', '细胞团呈三维簇团结构', '栅栏状排列紊乱', '乳头状排列紊乱', '菊形团排列', '腺腔样排列', '细胞的大小形态不一，排列紊乱'

是否为挖空细胞：否, '不完全挖空化细胞', '挖空细胞'

是否为非典型角化细胞：'非典型角化细胞', 

'''